'''Blackjack (EASY)
เกมแบล็กแจ็ค (blackjack) หรือเกม 21 แต้ม เป็นเกมไพ่ที่มีการเล่นเกมแบบง่าย ๆ คือ เริ่มจากการจั่วไพ่ 2 ใบจากสำรับ ไพ่ A มีคะแนน 1 หรือ 11 คะแนน, ไพ่ 2-10 มีคะแนนตามเลขบนไพ่ และไพ่ J Q K มีคะแนน 10 คะแนน ผู้เล่นต้องการให้คะแนนรวมของไพ่บนมือมีมากที่สุด แต่ไม่เกิน 21 คะแนน เมื่อจั่วไพ่ 2 ใบแรกแล้ว ผู้เล่นสามารถเลือกที่จะหยุดหรือจั่วไพ่เพิ่มได้อีกไม่เกิน 3 ไพ่ (รวมมีไพ่บนมือไม่เกิน 5 ใบ) เพื่อให้คะแนนรวมของไพ่บนมือสูงขึ้น แต่ในขณะเดียวกันก็มีโอกาสทำให้คะแนนรวมเกิน 21 คะแนน หากคะแนนรวมของไพ่บนมือเกิน 21 คะแนน จะถือว่าผู้เล่นคนนั้นแพ้ (busted)
เนื่องจากเกมนี้เป็นเกมที่ต้องเล่นหลายคน (multiplayer game) คุณจึงต้องการบอทที่ช่วยการฝึกซ้อม วิธีการเล่นของบอทที่ต้องการคือ บอทจะจั่วไพ่จากกองจนกว่า คะแนนรวมจะมีค่ามากกว่า 16 หรือมีไพ่บนมือครบ 5 ใบ หลังจากนั้น บอทจะแสดงคะแนนรวมที่ได้ ในกรณีที่บอทมีคะแนนรวมมากกว่า 21 คะแนน จะแสดงคำว่า “busted”
เพื่อความง่าย จะกำหนดให้ A มีคะแนน 1 คะแนนเท่านั้น เนื่องจากคุณเป็นโปรแกรมเมอร์ คุณจึงจะเขียนบอทสำหรับฝึกซ้อมด้วยตัวเอง
ข้อมูลเข้า
บรรทัดแรก เป็นจำนวนกรณีทดสอบ N ชุด (1 <= N <= 100)
ถัดมา N บรรทัด แต่ละบรรทัดจะระบุไพ่ 5 ใบที่อยู่ถัดไปในกองสำรับ ไพ่แต่ละใบสามารถเป็น A, 2, 3, …, 10, J, Q หรือ K คั่นด้วยเว้นวรรค
ข้อมูลออก
สำหรับแต่ละกรณีทดสอบ ให้แสดงคำตอบ 1 บรรทัด ในกรณีที่คะแนนรวมของบอทไม่เกิน 21 คะแนน ให้แสดงคะแนนรวมนั้น และในกรณีที่คะแนนรวมเกิน 21 คะแนน ให้แสดงว่า “busted” โดยไม่มีเครื่องหมายคำพูด
ตัวอย่าง
ข้อมูลเข้า	ข้อมูลออก
3
A 10 8 2 7
4 5 3 J Q
6 2 A 3 4	19
busted
16
สำหรับข้อมูลเข้า `A 10 8 2 7` หมายความว่าไพ่ 5 ใบบนสุดของสำรับ คือ `A 10 8 2 7` ตามลำดับ
บอทต้องหยิบไพ่มาก่อน 2 ใบ จะได้ `A` และ `10` ซึ่งมีคะแนนรวมคือ 11 ซึ่งยังไม่มากกว่า 16
จึงหยิบไพ่เพิ่มอีก 1 ใบ ได้ `8` ทำให้ได้คะแนนรวมเป็น 19 ซึ่งมากกว่า 16 แล้ว บอทจึงไม่สนใจจะหยิบไพ่อีก
สำหรับข้อมูลเข้า `4 5 3 J Q` หมายความว่าไพ่ 5 ใบบนสุดของสำรับ คือ `4 5 3 J Q` ตามลำดับ
บอทต้องหยิบไพ่มาก่อน 2 ใบ จะได้ `4` และ `5` ซึ่งมีคะแนนรวมคือ 9 ซึ่งยังไม่มากกว่า 16
จึงหยิบไพ่เพิ่มอีก 1 ใบ ได้ `3` ทำให้ได้คะแนนรวมเป็น 12 ซึ่งยังไม่มากกว่า 16
จึงหยิบไพ่เพิ่มอีก 1 ใบ ได้ `J` ทำให้ได้คะแนนรวมเป็น 22 ซึ่งมากกว่า 16 แล้ว บอทจึงไม่สนใจจะหยิบไพ่อีก
แต่ 22 มากกว่า 21 จึงเป็น busted
สำหรับข้อมูลเข้า `6 2 A 3 4` หมายความว่าไพ่ 5 ใบบนสุดของสำรับ คือ `6 2 A 3 4` ตามลำดับ
บอทต้องหยิบไพ่มาก่อน 2 ใบ จะได้ `6` และ `2` ซึ่งมีคะแนนรวมคือ 8 ซึ่งยังไม่มากกว่า 16
จึงหยิบไพ่เพิ่มอีก 1 ใบ ได้ `A` ทำให้ได้คะแนนรวมเป็น 9 ซึ่งยังไม่มากกว่า 16
จึงหยิบไพ่เพิ่มอีก 1 ใบ ได้ `3` ทำให้ได้คะแนนรวมเป็น 12 ซึ่งยังไม่มากกว่า 16
จึงหยิบไพ่เพิ่มอีก 1 ใบ ได้ `4` ทำให้ได้คะแนนรวมเป็น 16 ซึ่งยังไม่มากกว่า 16
แต่ไม่สามารถหยิบไพ่เพิ่มได้อีก เพราะไพ่บนมือมี 5 ใบแล้ว'''

test = int(input())
special = ['J', 'Q', 'K']
for i in range(test):
    cards = input().split()
    hand = 0
    total = 0
    for card in cards:
        if card == 'A':
            total += 1
        elif card in special:
            total += 10
        else:
            total += int(card)
        hand += 1
        if hand >= 2 and total > 16:
            break
        if hand == 5:
            break
    if total > 21:
        print('busted')
    else:
        print(total)

