เขียนโปรแกรมเพื่อรับค่าเศษส่วนในรูป a/b เมื่อ a และ b เป็นจำนวนเต็มบวกใด ๆ โดย a และ b มีค่าไม่เกิน 10000 บรรทัดแรกเป็นค่าเศษ a และบรรทัดที่สองเป็นค่าส่วน b
จากนั้นแสดงเศษส่วนอย่างต่ำของเศษส่วนดังกล่าว

เศษส่วนอย่างต่ำ คือ เศษส่วนที่อยู่ในรูป p/q โดย ห.ร.ม. ของ p และ q เป็น 1
กรณีที่ตัวส่วนของเศษส่วนอย่างต่ำ มีค่าเป็น 1 จะแสดงเฉพาะตัวเศษ
เศษส่วนอย่างต่ำ อาจอยู่ในรูป เศษส่วนแท้ หรือ เศษเกิน ก็ได้
ตัวอย่างโปรแกรม 1

108
96
= 9/8
ตัวอย่างโปรแกรม 2

25
5
= 5


#include <stdio.h>
#include <stdlib.h>
int main()
{
    char min[100], nin[100];
    int oldm, oldn, m, n, k, gcd;
    fgets(min, 100, stdin);
    m = atoi(min);
    fgets(nin, 100, stdin);
    n = atoi(nin);
    
    oldm = m;
    oldn = n;
    while (n != 0) {
        k = n;
        n = m % n; 
        m = k; 
    }

    gcd = m;
    oldm /= gcd;
    oldn /= gcd;
    
    if (oldn == 1) {
        printf("= %d\n", oldm);
    }else if (oldn != 1) {
        printf("= %d/%d\n", oldm, oldn);
    }
    return 0;
}