'''ตัดเลขที่ไม่เรียงลำดับออกจากลิสต์
ให้เขียนโปรแกรมรับเลขจำนวนเต็มบวกเข้ามาเรื่อยๆ จนผู้ใช้ใส่ค่า -1 จึงหยุด จากนั้นให้สร้างลิสต์จากตัวเลขที่รับเข้ามาโดยทิ้งเลขที่ไม่เรียงลำดับไป แล้วพิมพ์ลิสต์นั้นออกมา เลขที่เรียงลำดับคือเลขที่มากกว่าหรือเท่ากับตัวเลขก่อนหน้า (ไม่นับเลขที่ถูกทิ้งไปแล้ว)

ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
5
3
6
10
-1	[5, 6, 10]
2
12
6
10
-1	[2, 12]'''
import math
data = [] 
x = 0
new = -math.inf
while True:
    x = int(input())
    if x == -1 :
        break
    elif x > new :
        data.append(x)
        new = x
print(data)

