'''ลบข้อมูลซ้ำในลิสต์
จงเขียนฟังก์ชัน remove_duplicates(t) ซึ่งรับลิสต์ t แล้วคืนลิสต์ใหม่ที่เกิดจากการเอาลิสต์ t มาลบสมาชิกที่มีซ้ำออกไป ค่าที่ปรากฏอยู่ในลิสต์ตั้งแต่สองครั้งเป็นต้นไปให้คงตัวแรกไว้แล้วลบตัวที่มาทีหลังออกให้หมด

ลิสต์ t จะต้องไม่เปลี่ยนแปลงหลังจบการทำงานของฟังก์ชัน

ตัวอย่าง
>>> remove_duplicates([1, 2, 3, 2, 1, 2, 3, 4])
[1, 2, 3, 4]
>>> remove_duplicates(['a', 'b', 'c', 'e', 'f'])
['a', 'b', 'c', 'e', 'f']
>>> remove_duplicates([2, 2, 2, 2, 1, 1, 2, 1, 1, 3, 3, 3])
[2, 1, 3]
หมายเหตุ: ให้นิสิตเขียนโปรแกรมทดสอบฟังก์ชันเอง โดยไม่ต้องส่งโปรแกรมทดสอบนั้น (ส่งเฉพาะการทำงานของฟังก์ชัน)'''
def remove_duplicates(t):
    array = []
    for num in t :
        if num not in array :
            array.append(num)
    return array
print(remove_duplicates(['a', 'b', 'c', 'e', 'f']))