'''Chemical Formula
สารประกอบในชีวิตประจำวัน จะประกอบด้วยอะตอมของธาตุต่าง ๆ ในอัตราส่วนที่เหมาะสม กลายเป็นสูตรเคมี เช่น
น้ำ มีสูตรเคมีว่า H2O ใน 1 โมเลกุล ประกอบด้วย H 2 อะตอม และ O 1 อะตอม
disodium tetrafluorostannate มีสูตรเคมีว่า F4Na2Sn ใน 1 โมเลกุล ประกอบด้วย F 4 อะตอม, Na 2 อะตอม และ Sn 1 อะตอม
Ferrocene มีสูตรเคมีว่า FeC10H10 ใน 1 โมเลกุล ประกอบด้วย Fe 1 อะตอม, C 10 อะตอม และ H 10 อะตอม
สังเกตว่าสัญลักษณ์ธาตุอาจเป็นตัวอักษรภาษาอังกฤษตัวใหญ่ตัวเดียว เช่น H หรือตัวอักษรภาษาอังกฤษตัวใหญ่ 1 ตัว และตัวเล็ก 1 ตัว ติดกัน เช่น Fe และจากสูตรเคมี สามารถหาจำนวนอะตอมของธาตุ โดยดูจากตัวเลขที่ตามหลังสัญลักษณ์ธาตุ หากไม่มีตัวเลขตามหลัง ให้ถือว่ามีจำนวนอะตอมเป็น 1
สูตรเคมีอาจอยู่ในรูปแบบสูตรโครงสร้าง เช่น น้ำส้มสายชู CH3COOH ซึ่งมี C 2 อะตอม, H 4 อะตอม และ O 2 อะตอม เมื่อเขียนเป็นสูตรโมเลกุล จะได้เป็น C2H4O2
เนื่องจากคุณเป็นโปรแกรมเมอร์ คุณจึงอยากทราบว่าในสูตรเคมี 1 โมเลกุล ประกอบด้วยธาตุที่ต้องการกี่อะตอม ซึ่งรับประกันว่า ข้อมูลทดสอบเป็นสูตรเคมีในรูปของสูตรโมเลกุล ของสารประกอบที่มีอยู่จริง
ข้อมูลเข้า
บรรทัดแรก สูตรเคมีของสารประกอบหนึ่งในรูปของสูตรโมเลกุล
บรรทัดที่สอง ระบุธาตุที่ต้องการค้นหาจำนวนอะตอมของธาตุในสูตรเคมี
ข้อมูลออก
บรรทัดเดียว แสดงคำตอบ 1 บรรทัด ซึ่งเป็นจำนวนอะตอมของธาตุในสูตรเคมี
ตัวอย่าง
ข้อมูลเข้า	ข้อมูลออก
Fe3H2Na2O45Si
O
45
Sr2RuO4
Ru
1
CoC2O4
C
2
C17H19N3O3S
Co
0'''
def tak_atom(formula):
    asw = {}
    chem, num = '', ''
    chem = formula[0]
    for i in range(1, len(formula)):
        ch = formula[i]
        if ch.isalpha():
            if ch.isupper():
                if num == '':
                    num = '1'
                asw[chem] = int(num)
                chem, num = ch, ''
            else:
                chem += ch
        else:
            num += ch
    if num == '':
        num = '1'
    asw[chem] = int(num)
    return asw

formula = input()
atom = input()
atoms = tak_atom(formula)
print(atoms.get(atom, 0))