'''ใส่ " ใน CSV
ไฟล์ CSV จะเก็บข้อมูลในแต่ละบรรทัดโดยคั่นระหว่างข้อมูลด้วยอักขระ , เช่น a,b,c,d,e เป็นต้น

ให้นิสิตเขียนโปรแกรมรับบรรทัดของไฟล์ CSV เข้ามาบรรทัดเดียว แล้ว

ตัดช่องว่างข้างหน้าและข้างหลังข้อมูลแต่ละตัวออกถ้ามี (แต่ช่องว่างภายในให้คงไว้)
ใส่ "" คร่อมข้อมูลแต่ละตัว แล้วพิมพ์บรรทัดใหม่ออกมา
ท้าทาย: ไม่ใช้ method .split() และ .strip() ในข้อนี้
ตัวอย่างข้อมูลเข้า/ข้อมูลออก'''
word = input()
result = ""
data = ""
data2 = 0
for i in word:
     if i == ',':
       result += '"' + data.strip() + '",'
       data = ""
     else:
       data += i
result += '"' + data.strip() + '"'
print(result)

