'''BMI
ค่า BMI (Body Mass Index) เป็นค่าที่ใช้วัดความอ้วน เพื่อประเมินหาไขมันส่วนเกินในร่างกาย เพื่อคำนวณความเสี่ยงในการเป็นโรค

ความสำคัญของการรู้ค่าดัชนีมวลร่างกาย เพื่อประเมินหาส่วนไขมันในร่างกาย ซึ่งค่าดังกล่าวนิยมใช้ในการคำนวณอย่างแพร่หลาย เนื่องจากคำนวณง่าย และสามารถใช้ได้กับทุกเพศ ทุกวัย และทุกเชื้อชาติ

สูตรการคำนวณ BMI คือ
w
e
i
g
h
t
h
e
i
g
h
t
2
ซึ่ง weight มีหน่วยเป็น กิโลกรัม (kg) และ height มีหน่วยเป็น เมตร (m)

จงเขียนโปรแกรมเพื่อคำนวณค่า BMI โดยบอกว่าค่า BMI ที่ได้นั้นเป็นเช่นไร เมื่อเทียบกับเกณฑ์ดังนี้

Underweight เมื่อค่า BMI น้อยกว่า 18.5
Normal weight เมื่อค่า BMI มีค่าตั้งแต่ 18.5 แต่ไม่ถึง 25
Overweight เมื่อค่า BMI มีค่าตั้งแต่ 25 แต่ไม่ถึง 30
Obesity เมื่อค่า BMI มีค่าไม่ต่ำกว่า 30
ข้อมูลเข้า
บรรทัดแรก รับค่าน้ำหนักในหน่วยกิโลกรัม โดยมี Prompt ตามตัวอย่าง
บรรทัดที่สอง รับค่าส่วนสูงในหน่วยเมตร โดยมี Prompt ตามตัวอย่าง
ข้อมูลออก
บรรทัดแรก แสดงข้อความ "BMI is " ตามด้วยค่า BMI ที่คำนวณได้จากสูตร โดยใช้ทศนิยม 1 ตำแหน่ง
บรรทัดที่สอง แสดงข้อความผลลัพธ์ของค่า BMI ตามเกณฑ์ข้างต้น
ตัวอย่างที่ 1
Weight (kg): 56
Height (m): 1.65
BMI is 20.6
Normal weight
ตัวอย่างที่ 2
Weight (kg): 86
Height (m): 1.70
BMI is 29.8
Overweight'''
w = float(input("Weight (kg): "))
h = float(input("Height (m): "))
bmi = w / (h ** 2)
print(f'BMI is {bmi:.1f}')
if bmi < 18.5 :
    print ('Underweight')
elif  bmi >= 18.5 and bmi < 25 :
    print ('Normal weight')
    
elif  bmi >= 25  and bmi < 30 :
    print ('Overweight')
    
elif  bmi > 30:
    print ('Obesity') 