'''สระว่ายน้ำ
กำหนดให้สระว่ายน้ำ (pool) เป็นรูปสี่เหลี่ยมผืนผ้า โดยเราต้องการเติมน้ำลงไปในสระให้เต็ม จงเขียนโปรแกรมเพื่อรับความกว้าง ความยาว และความลึกของสระในหน่วยเมตร เพื่อคำนวณว่า ต้องใช้เวลากี่นาทีในการเติมน้ำลงในสระให้เต็ม เมื่อกำหนดให้ใช้เวลา 15 วินาทีในการเติมน้ำ 1 ลูกบาศก์เมตร

สมมติฐานของข้อมูลนำเข้า ความกว้าง ความยาว และความลึกเป็นจำนวนจริง

แสดงคำตอบด้วยทศนิยมสองตำแหน่ง

ตัวอย่าง Input/Output
Enter width: 18.5
Enter length: 38.75
Enter depth: 1.35
Time to fill a pool is 241.95 minutes.'''
w = float(input("Enter width: "))
l = float(input("Enter length: "))
d = float(input("Enter depth: "))
time = (w * l * d * 15 ) / 60
print(f"Time to fill a pool is {time:.2f} minutes.")