'''พิมพ์ดาวหลายบรรทัด
ให้นิสิตเขียนโปรแกรมรับจำนวนเต็มบวก n และเครื่องหมายแทนดาว แล้วพิมพ์เครื่องหมายแทนดาวจำนวน n บรรทัด โดยแสดงผลดาว i ดวง สำหรับบรรทัดที่ i

ข้อมูลเข้า
บรรทัดแรก รับจำนวนเต็มบวก n แทนจำนวนบรรทัดที่จะพิมพ์
บรรทัดที่สอง รับเครื่องหมาย c แทนดาวหนึ่งดวง
ข้อมูลออก
แสดงเครื่องหมายแทนดาวจำนวน n บรรทัด โดยบรรทัดที่ i จะแสดงดาว i ดวง
ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
6
@	        @
            @@
            @@@
            @@@@
            @@@@@
            @@@@@@
3
.	        .
            ..
            ...'''
n = int(input(""))
c = input("")
i = 1
while i <= n:
    print(c * i)
    i += 1