'''กฎของเก้า
จำนวนเต็มบวกที่หารด้วย 9 ลงตัว ตรวจสอบได้โดยการนำผลบวกของเลขโดดในจำนวนเต็มบวก หารด้วย 9 ถ้าผลบวกนั้นหารด้วย 9 ลงตัว แสดงว่าจำนวนเต็มบวกนั้นหารด้วย 9 ลงตัว แต่ถ้าผลบวกนั้นหารด้วย 9 ไม่ลงตัว แสดงว่าจำนวนเต็มบวกนั้นจะหารด้วย 9 ไม่ลงตัว และเศษจากการหารผลบวกของเลขโดดด้วย 9 จะเท่ากับเศษจากการหารจำนวนเต็มบวกด้วย 9 เช่นกัน

เขียนโปรแกรมเพื่อรับจำนวนเต็มบวกจำนวนหนึ่ง และตรวจสอบว่าจำนวนที่รับเข้ามาหารด้วย 9 ลงตัวหรือไม่ โดยใช้กฏของเก้า ถ้าหารลงตัวให้แสดง "Yes" และผลบวกของเลขโดด แต่ถ้าหารไม่ลงตัวให้แสดง "No" และเศษของการหาร

  * ไม่อนุญาตให้ใช้การทำงานในแบบ string หรือ list

ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
818181	Yes 27
818282	No 2'''
x = int(input())
sum = 0

while x > 0:
   sum += x % 10
   x //= 10
   
result = sum % 9
if result == 0:
    print(f"Yes {sum}")
else:
    print(f"No {result}")