'''ตึกระฟ้าที่มองเห็น
ในเมืองใหญ่จะมีตึกระฟ้าหลากหลายตึกตั้งอยู่ ตึกเหล่านี้ความสูงไม่เท่ากันและอาจบังกันได้ทำให้เรามองเห็นตึกไม่ครบทุกตึก ให้นิสิตเขียนโปรแกรมรับความสูงของตึกเข้ามาเรื่อยๆ จนความสูงเป็น -1 ค่อยหยุด แล้วคำนวณว่าเราจะมองเห็นตึกกี่ตึก ถ้าตึกทั้งหมดเรียงตัวกันอยู่ในแนวเส้นตรงเรียงตามลำดับของข้อมูลเข้า กำหนดว่าตึกข้างหน้าจะบังกันตึกข้างหลังเมื่อตึกข้างหลังมีความสูงน้อยกว่าหรือเท่ากับตึกที่อยู่ข้างหน้า

ทั้งนี้ ต้องเป็นการดำเนินการของจำนวนเต็มเท่านั้น (ไม่อนุญาตให้ใช้การทำงานในแบบ string หรือ list)

ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
6
3
5
7
-1	         2
17
18
17
19
-1	         3
ตัวอย่างการทำงาน
6
3
5
7
-1
2
คำอธิบาย : ตึกความสูง 6 เป็นตึกแรกจะบังตึกที่สูง 3 และ 5 แต่จะเห็นตึกที่สูง 7 ดังนั้นจึงเห็นสองตึก (6 กับ 7)'''
c = 0
mx = -1
while True:
    h = int(input(""))
    if h == -1:
        break
    if h > mx:
        c += 1
        mx = h
print(c)