'''หมดสิทธิ์สอบ
คาบปฏิบัติการวิชา Fundamental Programming Concepts กำหนดว่า นิสิตที่มีจำนวนคาบของการเข้าเรียนน้อยกว่าเกณฑ์ที่กำหนด และมีความสำเร็จในการทำแบบฝึกหัดต่ำกว่าเกณฑ์ที่กำหนด จะหมดสิทธิ์สอบปฏิบัติการปลายภาค

ให้นิสิตเขียนโปรแกรมเพื่อจะตรวจสอบว่านิสิตคนใดหมดสิทธิ์สอบปฏิบัติการปลายภาค และแสดงรายชื่อของผู้หมดสิทธิ์สอบ

ข้อมูลเข้า
บรรทัดแรก รับชุดของจำนวนเต็มบวก แทนจำนวนแบบฝึกหัดของแต่ละชุด คั่นด้วยช่องว่าง
เช่น 6 7 6 8 หมายความว่า มีแบบฝึกหัด 4 ชุด แต่ละชุดมีจำนวน 6 ข้อ, 7 ข้อ, 6 ข้อ และ 8 ข้อ ตามลำดับ
บรรทัดที่สอง รับจำนวนจริงบวกสองจำนวน คั่นด้วยช่องว่าง แทนเกณฑ์ร้อยละของจำนวนคาบของการเข้าเรียน และเกณฑ์ร้อยละของความสำเร็จในการทำแบบฝึกหัดที่ต้องการตามลำดับ หากนิสิตมีจำนวนคาบของการเข้าเรียนน้อยกว่าเกณฑ์ร้อยละที่กำหนด และมีความสำเร็จในการทำแบบฝึกหัดต่ำกว่าเกณฑ์ร้อยละนี้ นิสิตจะหมดสิทธิ์สอบปฏิบัติการปลายภาค
เช่น 80.0 85.0 หมายความว่า นิสิตที่มีจำนวนคาบของการเข้าเรียนน้อยกว่าร้อยละ 80.0 และมีความสำเร็จในการทำแบบฝึกหัดต่ำกว่าร้อยละ 85.0 จะหมดสิทธิ์สอบปฏิบัติการปลายภาค
บรรทัดที่สาม รับจำนวนเต็มบวก n แทนจำนวนนิสิตในวิชานี้
บรรทัดที่สี่ ถึง 3 + n รับชุดของจำนวนเต็ม 0 หรือ 1 จำนวน n บรรทัด บรรทัดละชุดจำนวน คั่นแต่ละจำนวนด้วยช่องว่าง แต่ละบรรทัดแทนการเข้าเรียน (1) หรือขาดเรียน (0) ของนิสิตในแต่ละคาบ ตามลำดับของนิสิตหมายเลขที่ 1 ถึงหมายเลขที่ n
เช่น 1 0 1 1 1 0 1 0 1 1 1 1 หมายความว่า นิสิตหมายเลขนี้ เข้าเรียน 12 คาบ (ตามจำนวนเลข 1) และขาดเรียน 3 คาบ (ตามจำนวนเลข 0)
บรรทัดที่ 4 + n เป็นต้นไป รับชุดของจำนวนเต็มบวก n บรรทัด บรรทัดละชุดจำนวน คั่นแต่ละจำนวนด้วยช่องว่าง แต่ละบรรทัดแทนจำนวนแบบฝึกหัดที่นิสิตหมายเลขนั้นทำสำเร็จในแต่ละชุดแบบฝึกหัด ตามลำดับของนิสิต หมายเลขที่ 1 ถึงคนที่ n
เช่น 5 7 6 7 หมายความว่า นิสิตหมายเลขนี้ ทำแบบฝึกหัด 4 ชุด ได้สำเร็จ 5 ข้อ, 7 ข้อ, 6 ข้อ และ 7 ข้อ ตามลำดับ
ข้อมูลออก
บรรทัดแรก แสดงจำนวนของนิสิตที่หมดสิทธิ์สอบปฏิบัติการปลายภาค
บรรทัดที่สองเป็นต้นไป แสดงหมายเลขของนิสิต ร้อยละของการเข้าเรียน และร้อยละของความสำเร็จในการทำแบบฝึกหัดของนิสิตคนนั้น คั่นด้วยช่องว่าง แต่นิสิตหมายเลขใดที่หมดสิทธิ์สอบให้แสดงวงเล็บครอบหมายเลขของนิสิตคนนั้นด้วย
ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
6 7 6 8
80.0 85.0
4
1 0 1 1 1 0 1 0 1 1 1 1
1 1 1 1 1 1 1 0 1 0 1 1
1 0 1 1 0 0 1 0 1 1 0 1
1 1 1 1 1 0 1 0 0 0 0 0
5 7 6 7
6 5 6 8
6 7 6 8
6 0 0 0

1
1 75.00 92.59
2 83.33 92.59
3 58.33 100.00
(4) 50.00 22.22
7 6 8 10 7 8 8 8 10
80.0 85.0
10
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
0 0 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 0 1 1 1 0 0 0 1 1 1 1 0
1 0 1 1 0 0 1 1 1 0 0 0 1 1 0
1 1 1 1 0 1 1 1 1 1 1 1 0 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 0 0 1 1 1 1 1 1 1
1 1 1 1 0 1 1 1 1 0 1 1 0 1 1
1 1 0 1 1 1 0 1 1 1 0 0 1 1 1
0 1 1 0 1 1 0 1 1 0 1 1 0 1 1
7 5 5 5 7 8 8 8 8
7 6 8 10 7 8 7 8 10
0 0 0 0 0 0 0 0 0
0 6 8 10 7 8 8 8 10
6 5 7 9 6 7 7 7 9
7 5 4 5 3 8 8 8 10
6 6 8 10 7 8 8 7 8
5 6 5 5 2 8 0 0 9
5 4 6 8 4 5 6 6 10
0 6 8 0 7 8 0 8 10
3
1 100.00 84.72
2 86.67 98.61
(3) 66.67 0.00
4 53.33 90.28
5 86.67 87.50
6 100.00 80.56
7 86.67 94.44
8 80.00 55.56
(9) 73.33 75.00
(10) 66.67 65.28'''
