'''Minesweeper
เขียนโปรแกรมเพื่อระบุจำนวนทุ่นระเบิด ที่อยู่รอบแต่ละช่อง ในตารางขนาด m x n ใด ๆ
โดยช่องที่เป็นทุ่นระเบิดให้แทนด้วย *
ช่องที่ไม่ใช่ทุ่นระเบิด ให้แสดงจำนวนทุ่นระเบิดที่อยู่รอบช่องนั้นว่ามีกี่ลูก (8 ทิศรอบช่องนั้น)

ข้อมูลเข้า
บรรทัดแรก รับจำนวนเต็มบวก m และ n คั่นด้วย x ซึ่งเป็นขนาดของตาราง m x n
บรรทัดที่สอง รับจำนวนเต็มบวก p แทนจำนวนของทุ่นระเบิดทั้งหมดที่อยู่ในตาราง
p บรรทัดต่อมา แต่ละบรรทัด รับจำนวนเต็ม x และ y คั่นด้วย , แทนพิกัด x, y ของทุ่นระเบิดในตาราง โดยมุมซ้ายบนสุดคือพิกัด (0, 0)
ข้อมูลนำเข้าจะเป็นข้อมูลที่ถูกต้องเสมอ (เช่น พิกัด (x, y) ของทุ่นระเบิด จะอยู่ในตารางขนาด m x n เสมอ)

ข้อมูลออก
m บรรทัด แต่ละบรรทัด แสดง n ตัวอักษร แทน n ช่อง แต่ละช่องประกอบด้วย ทุ่นระเบิดซึ่งแทนด้วย * หรือจำนวนทุ่นระเบิดรอบช่องนั้นซึ่งแทนด้วย ตัวเลข 0-8

ตัวอย่างข้อมูลเข้า/ข้อมูลออก

ข้อมูลเข้า	ข้อมูลออก
8x10
4
1,1
2,4
5,2
6,8
                1110000000
                1*11110000
                1111*10000
                0001110000
                0111000000
                01*1000111
                01110001*1
                0000000111
5x8
10
0,0
0,2
1,0
1,1
2,2
2,1
3,3
3,0
4,1
4,5
                    *4*10000
                    **420000
                    4**21000
                    *44*2110
                    2*212*10'''

def minesweeper(mn, p, *bomb):
    m, n = map(int, mn.split('x'))
    board = [['0' for _ in range(n)] for _ in range(m)]
    for b in bomb:
        x, y = map(int, b.split(','))
        board[x][y] = '*'
        for i in range(x-1, x+2):
            for j in range(y-1, y+2):
                if 0 <= i < m and 0 <= j < n and board[i][j] != '*':
                    board[i][j] = str(int(board[i][j]) + 1)
    return '\n'.join([''.join(row) for row in board])

print(minesweeper('8x10', 4, '1,1', '2,4', '5,2', '6,8'))

