'''ทอนเงิน (ธนบัตรใดๆ)
ให้นิสิตเขียนโปรแกรมทอนเงิน แต่ครั้งนี้ให้จำนวนและมูลค่าของธนบัตรนั้นถูกกำหนดโดยผู้ใช้

โปรแกรมจะรับข้อมูลจำนวนของประเภทธนบัตร (n) มาก่อนในบรรทัดแรก จากนั้นบรรทัดที่ 2 ถึง n+1 จะรับมูลค่าของธนบัตรทีละใบ มูลค่าของธนบัตรที่ใส่เข้ามาอาจไม่เรียงลำดับก็ได้ จากนั้นโปรแกรมจะรับจำนวนเงินที่จะต้องทอนในบรรทัดสุดท้าย

โปรแกรมจะพิมพ์จำนวนธนบัตรแต่ละประเภทที่ต้องทอน โดยพิมพ์เรียงลำดับมูลค่าธนบัตรจากมากไปน้อย โดยการทอนเงินจะใช้หลักการว่าจะใช้ธนบัตรที่มีมูลค่ามากที่สุดเท่าที่จะทำได้ และจำนวนธนบัตรมีไม่จำกัด

ตัวอย่างข้อมูลเข้า/ข้อมูลออก

ข้อมูลเข้า	ข้อมูลออก
6
500
100
50
10
5
1
876
500: 1
100: 3
50: 1
10: 2
5: 1
1: 1
5
10
50
5
1
100
876
100: 8
50: 1
10: 2
5: 1
1: 1'''
n = int(input())
data = []
for i in range(n):
     money = int(input())
     data.append(money)
change = int(input())
data.sort(reverse=True)
for cash in data:
     if change >= cash:
          amount = 0
          amount = change // cash
          change -= amount * cash
          print(f'{cash}: {amount}')





