'''Count All Pythagorean AB
เขียนโปรแกรมภาษาไพทอน ที่รับเลขจำนวนเต็มบวก c แล้วแสดงผลลัพธ์เป็น "จำนวน" ของคู่เลขจำนวนเต็ม a และ b ที่เป็นไปตามสมการ a2 + b2 = c2

หมายเหตุ: ไม่ต้องนับคู่ที่ซ้ำ เช่น (3,4) กับ (4,3) ให้ถือเป็นคู่เดียว

ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
5	1
9	0
10	1
25	2
ตัวอย่างผลลัพธ์ที่ 1
5
1
เพราะมีแค่ a,b คู่เดียวคือ 3,4 ที่ 32 + 42 = 52
ตัวอย่างผลลัพธ์ที่ 2
9
0
ไม่มีเลขจำนวนเต็ม a b ใดที่ทำให้ a2 + b2 = c2
ตัวอย่างผลลัพธ์ที่ 3
10
1
ตัวอย่างผลลัพธ์ที่ 4
25
2
เพราะมีเลขจำนวนเต็มสองคู่ (7,24) กับ (15,20) ซึ่ง 72 + 242 = 252 และ 152 + 202 = 252
พิมพ์โปรแกรมของคุณลงในช่องว่างข้างล่างนี้'''
c = int(input(""))
a = 1
count = 0
while a < c:
    b = a
    while b < c:
        if a * a + b * b == c * c:
            count += 1
        b += 1
    a += 1
print(count)