'''Elab Test Case
จุดประสงค์ของวิชา Fundamental Programming Concept คือ ให้ผู้เรียนมีทักษะเบื้องต้น ในการเขียนโปรแกรมด้วยภาษา Python วิชานี้จึงจัดให้มีระบบตรวจสอบโปรแกรมอัตโนมัติ เรียกสั้น ๆ ว่า Elab โดยระบบนี้จะตรวจสอบโปรแกรมของผู้เรียน เทียบกับผลลัพธ์ของโปรแกรมที่ถูกต้อง เมื่อใช้ชุดทดสอบ (Test Case) เดียวกัน ซึ่งผู้เรียนจะไม่ทราบชุดทดสอบในระบบ เนื่องจากผู้เรียนจะต้องเขียนโปรแกรมที่สอดคล้องกับโจทย์ปัญหา ไม่ใช่สอดคล้องกับตัวอย่างเท่านั้น
ผลลัพธ์ของการตรวจสอบโปรแกรมจากระบบ Elab จะแสดงเป็นสัญลักษณ์เท่ากับจำนวนข้อของชุดทดสอบ มีสัญลักษณ์ 5 รูปแบบ คือ
P หมายถึง ผลการทดสอบได้คำตอบถูกต้องในชุดทดสอบข้อนั้น
C หมายถึง ผลการทดสอบได้คำตอบถูกต้อง แต่มีตัวอักษรตัวใหญ่หรือตัวเล็ก ไม่ตรงกับชุดทดสอบข้อนั้น
S หมายถึง ผลการทดสอบได้คำตอบถูกต้อง แต่มีช่องว่าง ไม่ตรงกับชุดทดสอบข้อนั้น
- หมายถึง ผลการทดสอบได้คำตอบไม่ถูกต้อง ในชุดทดสอบข้อนั้น
X หมายถึง โปรแกรมของผู้เขียนทำให้เกิดปัญหาที่ไม่สามารถระบุรูปแบบของปัญหาได้
เมื่อผู้เรียนส่งชุดคำสั่งเข้าไปในระบบ Elab จะได้ผลลัพธ์เป็นข้อความในเครื่องหมาย [ ] เช่น [PPP-] ซึ่งทำให้ทราบจำนวนชุดทดสอบทั้งหมด และจำนวนข้อที่ถูกต้อง ปัญหาบางข้ออาจอนุโลมให้สัญลักษณ์อื่นเป็นคำตอบที่ถูกต้องได้ และบางข้ออาจไม่มีชุดทดสอบ (ถือว่าไม่ให้คะแนนในข้อนั้น)
เนื่องจากคุณเป็นโปรแกรมเมอร์ และเป็นผู้เรียนที่ใช้ระบบ Elab มาตลอดในภาคการศึกษานี้ คุณจึงอยากเขียนโปรแกรมเพื่อตรวจสอบว่า เมื่อคุณส่งชุดคำสั่งเข้าไปในระบบ Elab แล้ว จะได้ข้อที่ถูกต้องกี่ข้อ คิดเป็นกี่เปอร์เซ็นต์
ข้อมูลเข้า
บรรทัดแรก เป็นข้อความผลลัพธ์จากการตรวจสอบของระบบ Elab
บรรทัดที่สอง เป็นสัญลักษณ์ที่ใช้เป็นเกณฑ์ในการตัดสินว่า ชุดทดสอบนั้นเป็นคำตอบที่ถูกต้องและได้คะแนน ไม่มีตัวคั่นระหว่างสัญลักษณ์
ข้อมูลออก
บรรทัดแรก แสดงจำนวนคำตอบที่ถูกต้องและได้คะแนนจากการตรวจสอบของระบบ Elab
บรรทัดที่สอง แสดงเปอร์เซ็นต์ของข้อที่ถูกต้อง (ทศนิยม 2 ตำแหน่ง)
ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
[PPP-]
PCS	3
75.00
[--PCPSS]
PC	3
42.86
[PCSPCSPCSP]
PS	7
70.00
[PPPPP]
PP
5
100.00'''
result = input()
target = input()
correct = 0
result = result[1:-1]
for i in result:
    if i in target:
        correct += 1
if result != '':
    print(correct)
    avg_score = (correct/len(result))*100
    print(f"{avg_score:.2f}")
else:
    print("0")
    print("0.00")

    

    
