'''คะแนนสอบ
ให้นิสิตเขียนโปรแกรมเพื่อแสดงผลรวมของค่าเฉลี่ยของคะแนนสอบสองครั้ง นั่นคือ คะแนนสอบกลางภาค และคะแนนสอบปลายภาค ซึ่งแต่ละครั้งมีคะแนนเต็ม 60 คะแนน

ตัวแปรเริ่มต้น
midterm แทนจำนวนจริงซึ่งเป็นคะแนนสอบกลางภาค โดย 0 <= midterm <= 60
final แทนจำนวนจริงซึ่งเป็นคะแนนสอบปลายภาค โดย 0 <= final <= 60

ข้อมูลออก
บรรทัดแรก แสดงข้อความ "Total: " ตามด้วยผลรวมของคะแนนสอบทั้งสองครั้ง
บรรทัดที่สอง แสดงข้อความ "Average: " ตามด้วยค่าเฉลี่ยของคะแนนสอบทั้งสองครั้ง (ไม่ต้องกังวลเรื่องการแสดงตำแหน่งทศนิยม)
ตัวอย่าง Output เมื่อ midterm มีค่า 50.5 และ final มีค่า 31.5
Total: 82.0
Average: 41.0'''
midterm = 50.5
final = 31.5
Total = midterm +  final 
print("Total:" ,Total )
Average= Total / 2
print ("Average:" ,Average)