'''ค่าตัดหญ้า
กำหนดให้อาณาเขตของตัวบ้าน (house) และรั้วบ้าน (block) เป็นรูปสี่เหลี่ยมผืนผ้า พื้นที่รอบตัวบ้านเป็นสนามหญ้าทั้งหมด

จงเขียนโปรแกรมเพื่อคำนวณหาค่าใช้จ่ายในการตัดหญ้า (mowing cost) เมื่อกำหนดให้อัตราค่าตัดหญ้าคิดเป็น 35 บาทต่อตารางเมตร โดยกำหนดให้ความกว้างและยาวของรั้วบ้าน และความกว้างและยาวของตัวบ้านมีหน่วยเป็นเมตร

ตัวแปรเริ่มต้น
block_length แทนความยาวของรั้วบ้าน (เมตร) ซึ่งเป็นจำนวนเต็ม
block_width แทนความกว้างของรั้วบ้าน (เมตร) ซึ่งเป็นจำนวนเต็ม
house_length แทนความยาวของตัวบ้าน (เมตร) ซึ่งเป็นจำนวนเต็ม
house_width แทนความกว้างของตัวบ้าน (เมตร) ซึ่งเป็นจำนวนเต็ม
MOW_RATE แทนอัตราค่าตัดหญ้า (บาทต่อตารางเมตร)
โดยข้อมูลในชุดทดสอบ ขนาดพื้นที่ของรั้วบ้านมีค่ามากกว่าหรือเท่ากับของตัวบ้านเสมอ

ตัวอย่าง Output เมื่อกำหนดค่าเริ่มต้นตามที่ระบุในโค้ดเริ่มต้น
Mowing cost is 2310.0 baht.'''
block_length = 12
block_width = 9
house_length = 7
house_width = 6

MOW_RATE = 35.0
l = block_length * block_width
w = house_length * house_width
m = l - w
total = m * MOW_RATE
print("Mowing cost is" ,total,"baht.")
