'''ลูกของสิงโตและเสือเรียกว่า liger (Mix Name)

National Geographic เป็นรายการสารคดีที่บอกเล่าเรื่องราวของสิ่งมีชีวิตในมุมมองต่าง ๆ วันหนึ่งรายการนี้ได้เล่าเรื่องของสิงโต (lion) และเสือ (tiger) ซึ่งสามารถผสมพันธุ์ข้ามสายพันธุ์ ได้ลูกผสมออกมา เรียกว่า liger (ถ้าพ่อพันธุ์เป็นสิงโต แม่พันธุ์เป็นเสือ) หรือ tigon (ถ้าพ่อพันธุ์เป็นเสือ แม่พันธุ์เป็นสิงโต)
คุณรู้สึกทึ่งในการนำชื่อของพ่อพันธุ์ และแม่พันธุ์ มาตั้งชื่อลูกผสม จึงสังเกตและตั้งกฎการตั้งชื่อของลูกผสมแบบหนึ่งขึ้นมา ดังนี้
“นำชื่อพ่อพันธุ์ส่วนที่อยู่ก่อนสระตัวที่สอง มาผสมกับชื่อของแม่พันธุ์ส่วนที่อยู่หลังสระตัวแรก”
กฎที่ตั้งขึ้นนี้ เข้ากันได้กับ tigon และ liger พอดี เนื่องจาก
tiger + lion = tigon
lion + tiger = liger
หากบางชื่อไม่สามารถหาส่วนที่อยู่ก่อนสระตัวที่สอง หรือส่วนที่อยู่หลังสระตัวแรกได้ จะใช้ชื่อเดิมไปเป็นส่วนประกอบของลูกผสม
เนื่องจากคุณเป็นโปรแกรมเมอร์ คุณจึงนำกฎนี้ไปเขียนโปรแกรมเพื่อหาชื่อของลูกผสม
ข้อมูลเข้า
บรรทัดแรก ชื่อของพ่อพันธุ์
บรรทัดที่สอง ชื่อของแม่พันธุ์
ข้อมูลออก
บรรทัดเดียว แสดงคำตอบ 1 บรรทัด ซึ่งเป็นชื่อของลูกผสม ตามกฎการตั้งชื่อดังกล่าว
ตัวอย่าง
ข้อมูลเข้า	ข้อมูลออก
tiger
lion
tigon
lion
tiger	liger
penguin
dragon
penggon
ant
butterfly
anttterfly'''
