'''ฉลาดเกมส์โกง
คุณรู้สึกว่าการทำข้อสอบเป็นเรื่องยาก จึงเริ่มคิดแผนการส่งคำตอบผ่านชุดข้อความหนึ่งที่มีการเข้ารหัสในแบบที่ไม่ให้ผู้คุมสอบรู้

แต่คุณก็ยังชะล่าใจจนถึงก่อนวันสอบหนึ่งวัน คุณจึงปรึกษามิสเตอร์จีเนียสและคิดวิธีง่าย ๆ ที่จะเข้ารหัสข้อความดังนี้

คุณและมิสเตอร์จีเนียสตกลง "ข้อความต้นฉบับ" ซึ่งเป็นข้อความสำหรับสร้างรหัส
คุณและมิสเตอร์จีเนียสตกลง "รหัสต้นฉบับ" ซึ่งเป็นรหัสที่สอดคล้องกับข้อความต้นฉบับ
คุณส่งคำถามให้มิสเตอร์จีเนียส โดยอาศัยข้อความต้นฉบับและรหัสต้นฉบับเป็นแม่แบบในการเข้ารหัส
มิสเตอร์จีเนียสถอดรหัสจากคำถามของคุณ แล้วส่งคำตอบมาให้คุณโดยใช้หลักการเดียวกันในการเข้ารหัส
คุณได้คำตอบจากมิสเตอร์จีเนียส คุณต้องถอดรหัส
หลักการเข้ารหัส

จากข้อความต้นฉบับ จะต้องนำช่องว่าง และตัวอักษรที่ซ้ำกันออกก่อน แล้วเทียบกับรหัสต้นฉบับแบบตัวต่อตัว จะได้วิธีการแปลงอักษร (รหัสต้นฉบับจะไม่มีช่องว่าง และไม่มีตัวอักษรซ้ำ) เช่น

ถ้าข้อความต้นฉบับเป็น "bad genius" และรหัสต้นฉบับเป็น "source120"
จะได้การเข้ารหัสว่า 'b' เข้ารหัสเป็น 's', 'a' เข้ารหัสเป็น 'o', 'd' เข้ารหัสเป็น 'u', 'g' เข้ารหัสเป็น 'r', 'e' เข้ารหัสเป็น 'c', 'n' เข้ารหัสเป็น 'e', 'i' เข้ารหัสเป็น '1', 'u' เข้ารหัสเป็น '2' และ 's' เข้ารหัสเป็น '0' ตามลำดับ
ถ้าข้อความต้นฉบับเป็น "the system32" และรหัสต้นฉบับเป็น "abcdefgh"
จะได้การเข้ารหัสว่า 't' เข้ารหัสเป็น 'a', 'h' เข้ารหัสเป็น 'b', 'e' เข้ารหัสเป็น 'c', 's' เข้ารหัสเป็น 'd', 'y' เข้ารหัสเป็น 'e', 'm' เข้ารหัสเป็น 'f', '3' เข้ารหัสเป็น 'g' และ '2' เข้ารหัสเป็น 'h' ตามลำดับ
หลักการถอดรหัส

จากหลักการเข้ารหัส วิธีถอดรหัสจะใช้การแปลงตัวอักษรย้อนกลับ เช่น ถ้า 'b' เข้ารหัสเป็น 's' จะได้ว่า 's' ถอดรหัสเป็น 'b'

ถ้าข้อความต้นฉบับเป็น "bad genius" และรหัสต้นฉบับเป็น "source120"
ถ้าถอดรหัส "source" จะได้ข้อความว่า "badgen"
หรือถอดรหัส "soeoeo" จะได้ข้อความว่า "banana"
กรณีที่ในข้อความที่ต้องการถอดรหัสมีตัวอักษรอื่นที่ไม่อยู่ในรหัสต้นฉบับ ให้คงตัวอักษรนั้นไว้ เช่น
ถ้าข้อความต้นฉบับเป็น "bad genius" และรหัสต้นฉบับเป็น "source120"
เมื่อถอดรหัส "h10 sor" จะได้ข้อความว่า "his bag"
เนื่องจากคุณเป็นโปรแกรมเมอร์ คุณจึงเขียนโปรแกรมเพื่อถอดรหัสข้อความที่มิสเตอร์จีเนียสส่งกลับมาให้คุณ

ข้อมูลเข้า มีสามบรรทัด

บรรทัดแรก รับข้อความต้นฉบับ
บรรทัดที่สอง รับรหัสต้นฉบับ ซึ่งไม่มีตัวอักษรซ้ำ ไม่มีช่องว่าง และมีจำนวนตัวอักษรที่พอดีกับการเข้ารหัส
บรรทัดที่สาม รับข้อความที่ต้องการถอดรหัส
ข้อมูลออก

มีบรรทัดเดียว แสดงคำตอบเป็นข้อความที่ถูกถอดรหัสแล้ว
ตัวอย่างข้อมูลเข้า/ข้อมูลออก

ข้อมูลเข้า	ข้อมูลออก
bad genius
123456789
9o8rc5 co35	source code
solution code for aeiou
1234567890abc
1234567890abc	solutincdefra
the quick brown fox jump over the lazy dogs
abcdefghijklmnopqrstuvwxyz
abc defgh ijklm nko peqr kscj abc tuvw xkyz.	the quick brown fox jump over the lazy dogs.'''