'''Majority Element
Majority element ของข้อมูลขนาด n เป็นสมาชิกใน list A ที่ปรากฏซ้ำมากกว่า n/2 ตำแหน่ง เช่น ถ้า n มีค่า 6 หรือ n มีค่า 7 แล้ว majority element เป็นสมาชิกที่ปรากฏซ้ำอย่างน้อยใน 4 ตำแหน่ง

จงเขียนโปรแกรมเพื่อรับข้อมูลจำนวน n+1 บรรทัด

บรรทัดแรกเป็นจำนวนเต็ม n

และอีก n บรรทัดถัดมาเป็นข้อมูลบรรทัดละ 1 ค่า

แล้วหาค่า majority element และแสดงผล ในกรณีที่ไม่มี majority element ให้แสดงค่า 0

ทั้งนี้กำหนดให้การดำเนินการที่กระทำได้ระหว่าง 2 สมาชิกใดๆ ในชุดข้อมูล คือ การเปรียบเทียบว่าเท่ากันหรือไม่เท่านั้น นั่นคือ ไม่อนุญาตให้เรียงลำดับข้อมูล

ตัวอย่างข้อมูลเข้า/ข้อมูลออก

ข้อมูลเข้า	ข้อมูลออก
10
R
R
B
R
G
B
B
G
B
G
0
20
A
B
B
B
B
C
D
B
F
B
C
D
B
B
F
B
A
B
B
D
B'''
