'''แปลงอุณหภูมิ
สูตรในการเปลี่ยนค่าจากองศาเซลเซียสไปเป็นองศาฟาเรนไฮต์และเคลวิน มีดังนี้ \[ F = \frac{9}{5}C + 32 \] \[ K = C + 273.15 \]

ให้คำนวณหาค่าองศาฟาเรนไฮต์และเคลวิน จากค่าอุณหภูมิองศาเซลเซียส ด้วยสมการด้านบน เมื่อ C คือ องศาเซลเซียส F คือ องศาฟาเรนไฮต์ และ K คือ เคลวิน

ตัวแปรเริ่มต้น
ตัวแปร C แทนค่าอุณหภูมิหน่วยองศาเซลเซียส เป็นจำนวนจริง

ข้อมูลออก
แสดงผลหนึ่งบรรทัด ประกอบด้วย ตัวเลขจำนวนจริงสองจำนวน คั่นด้วยเว้นวรรค จำนวนแรกคือ ค่าอุณหภูมิหน่วยองศาฟาเรนไฮต์ จำนวนที่สองคือ ค่าอุณหภูมิหน่วยเคลวิน

ตัวอย่าง Output เมื่อ C มีค่า 25.0
77.0 298.15'''
C = 25.0
f = 9 / 5 * C + 32
k = C + 273.15
print (f, k)