'''แตกหน่วยวินาที
จงเขียนโปรแกรมเพื่อแสดงผลเวลารวมที่ใช้ในการออกกำลังกายสองครั้งในรูปของจำนวนชั่วโมง นาที และวินาที ตามลำดับ

ตัวแปรเริ่มต้น
s1 แทนจำนวนวินาที (จำนวนเต็ม) ที่ใช้ออกกำลังกาย ครั้งที่ 1
s2 แทนจำนวนวินาที (จำนวนเต็ม) ที่ใช้ออกกำลังกาย ครั้งที่ 2

ข้อมูลออก
แสดงจำนวนชั่วโมง นาที และวินาที ของเวลาออกกำลังกายรวมทั้งสองครั้ง ในรูปแบบตามตัวอย่าง
ตัวอย่าง Output เมื่อ s1 มีค่า 345 และ s2 มีค่า 440
It is 0 hours 13 minutes and 5 seconds.
ตัวอย่าง Output เมื่อ s1 มีค่า 1600 และ s2 มีค่า 2000
It is 1 hours 0 minutes and 0 seconds.'''
s1 = 345
s2 = 440
sum1 = s1 + s2
hours = sum1 // 3600
minutes = sum1 % 3600 // 60
seconds = sum1 % 60
print("It is", hours, "hours", minutes, "minutes and", seconds, "seconds.")