'''Hangman 2
Hangman เป็นเกมทายคำศัพท์ โดยผู้เล่นจะทราบเพียงแค่ จำนวน ตัวอักษรของศัพท์ที่ให้มาเท่านั้น ให้ผู้เล่นเลือกทายอักษรที่ผู้เล่นคาดว่า มีอยู่ในคำที่โจทย์ให้มา หากอักษรที่ผู้เล่นทาย ไม่มีในศัพท์ที่โจทย์ให้มา ผู้เล่นก็จะถูกแขวนคอ เริ่มจาก หัว ลำตัว แขนซ้าย แขนขวา ขาซ้าย ขาขวา เมื่อผิดครบทั้ง 6 ครั้ง จึงถือว่า เป็นการแขวนคออย่างเต็มตัว ผู้เล่นก็จะแพ้ในเกมนั้น หากผู้เล่นสามารถทายศัพท์ถูกก่อนขาขวาจะโดนแขวน ผู้เล่นก็จะชนะในเกมนั้น

โดยข้อนี้ จะตัดบางส่วนของโปรแกรมเต็ม นั่นคือส่วนการแสดงตัวอักษรที่ทายถูก

ข้อมูลเข้า
บรรทัดแรก รับคำศัพท์ของโจทย์ที่ให้ผู้เล่นทาย โดยเป็นตัวอักษร a - z ตัวเล็กทั้งหมด ไม่มีช่องว่างหรืออักขระพิเศษอื่น และไม่เป็น string ว่าง มีจำนวนตัวอักษรทั้งหมดไม่เกิน 100 ตัวอักษร

บรรทัดถัดไป รับตัวอักษร (a-z ตัวเล็ก)ที่ผู้เล่นทายทีละตัว จนกว่าผู้เล่นจะใส่ 0

ข้อมูลออก
บรรทัดเดียว แสดงข้อความเหมือนโจทย์ เฉพาะตำแหน่งที่ทายตัวอักษรถูกแล้ว และตำแหน่งที่ยังทายตัวอักษรไม่ถูก ให้แสดง -

ตัวอย่างข้อมูลเข้า/ข้อมูลออก

ข้อมูลเข้า	ข้อมูลออก
hangman
a
b
c
a
0	-a---a-
thelonglengthword
a
e
o
u
i
t
0	t-e-o---e--t--o--'''
target = input()
correct = '-' * len(target)
i = 0
while True:
    guess = input()
    if guess == '0':
        break
    else:
         for i in range(len(target)):
            if target[i] == guess:
               correct = correct[:i] + guess + correct[i + 1:]
print(correct)
