'''Major Scale
บันไดเสียง Major Scale เป็นการจัดเรียงกลุ่มของตัวโน้ตที่เรียงกันเป็นลำดับขั้น ตามระดับของเสียงอย่างมีรูปแบบ มีเสียงห่างกันเป็นที่แน่นอน ซึ่งชุดบันไดเสียง Major Scale 1 ชุด ประกอบด้วยตัวโน้ต 8 ตัว เช่น
ชุดบันไดเสียง C Major ประกอบด้วย C, D, E, F, G, A, B, C (โด, เร, มี, ฟา, ซอล, ลา, ที, โด)
ชุดบันไดเสียง D Major ประกอบด้วย D, E, F#, G, A, B, C#, D (เร, มี, ฟาชาร์ป, ซอล, ลา, ที, โดชาร์ป, เร) เป็นต้น
สังเกตว่า โน้ตตัวแรกกับตัวสุดท้ายของชุดบันไดเสียงเป็นโน้ตเดียวกัน แต่มีเสียงสูงขึ้น หรือต่ำลงมา 8 ขั้น
ถ้าหน้ากากอินโทร (นักร้องคนหนึ่ง) เรียงโน้ตของบันไดเสียง C Major ไปเรื่อย ๆ จะได้ชุดตัวโน้ต C, D, E, F, G, A, B, C, D, E, F, G, A, B, C, … นั่นคือ โน้ตตัวที่ 12 จะเป็นโน้ต G หรือเรียงโน้ตของบันไดเสียง D Major ไปเรื่อย ๆ จะได้ชุดตัวโน้ต D, E, F#, G, A, B, C#, D, E, F#, G, A, B, C#, D, … ซึ่งจะได้โน้ตตัวที่ 14 คือ โน้ต C# และหน้ากากอินโทรบอกได้ว่าโน้ต 8 ตัว ในชุดบันไดเสียง Major Scale แบบต่าง ๆ มีตัวโน้ตอะไรบ้าง แต่ต้องการทราบว่าถ้าเรียงลำดับตัวโน้ตต่อไปเรื่อย ๆ ตัวที่ N จะเป็นโน้ตอะไร เนื่องจากคุณเป็นโปรแกรมเมอร์ คุณจะต้องช่วยหน้ากากอินโทรหาตัวโน้ตลำดับที่ N ในชุดบันไดเสียงที่กำหนด
ข้อมูลเข้า
บรรทัดแรก เป็นชุดตัวโน้ต 8 ตัวแรก ของบันไดเสียง Major Scale ชุดหนึ่ง คั่นด้วย comma (,)
บรรทัดที่สอง เป็นจำนวนเต็มบวก N แทนลำดับที่ของตัวโน้ตที่ต้องการหา เมื่อเรียงโน้ตของบันไดเสียง Major Scale
ข้อมูลออก
บรรทัดเดียว แสดงคำตอบ 1 บรรทัด ซึ่งเป็นโน้ตลำดับที่ N เมื่อเรียงโน้ตของบันไดเสียง Major Scale
ตัวอย่าง
ข้อมูลเข้า	ข้อมูลออก
C,D,E,F,G,A,B,C
12	G
D,E,F#,G,A,B,C#,D
14	C#
G#,A#,C,C#,D#,F,G,G#
21
G'''