'''Labsident Evil
ระหว่างที่คุณกำลังเขียนโปรแกรมด้วยภาษา Python อยู่ จิตใจคุณก็ล่องลอยไปนึกถึงเกมหนึ่ง ที่เป็นเกมการใช้ปืนยิงซอมบี้ทีละตัว คุณเริ่มจำลองเกมนี้โดยกำหนดให้เกมมีข้อกำหนดดังนี้
การยิงกระสุนแต่ละนัดจะสร้างค่าความเสียหายให้กับซอมบี้ 1 ตัว เท่านั้น
กระสุนแต่ละนัดสร้างความเสียหายให้กับซอมบี้เท่ากันทุกนัด
ต้องยิงซอมบี้ตัวแรกที่พบจนกว่าจะตายก่อน ทันทีที่ซอมบี้ตัวหนึ่งตาย จะต้องยิงซอมบี้ตัวถัดไปทันที
ถ้าซอมบี้มีค่าพลังชีวิต 25 หน่วย และกระสุนสร้างความเสียหายให้กับซอมบี้ 10 หน่วย ซอมบี้ตัวนี้จะตายด้วยกระสุนนัดที่ 3
สมมติว่าการยิงกระสุนแต่ละนัดไม่ใช่การยิงที่เปล่าประโยชน์
เกมนี้มีกระสุนปืนจำกัดเพราะแต่ละนัดนั้นแพงมาก แต่คุณเป็นเกมเมอร์ที่มีความแม่นยำในการยิงปืนสูงมาก คุณจึงได้เปรียบในการคำนวณจำนวนกระสุนปืนที่จะต้องใช้
เนื่องจากคุณเป็นโปรแกรมเมอร์ คุณจึงจะเขียนเกมจำลองการยิงซอมบี้ตามข้อกำหนดดังกล่าว
ข้อมูลเข้า
บรรทัดแรก เป็นจำนวนเต็มบวกแทนค่าความเสียหายของกระสุน 1 นัด ที่มีผลต่อซอมบี้ 1 ตัว
บรรทัดที่สอง ระบุค่าพลังชีวิตของซอมบี้ Z ตัว (Z > 0) ค่าพลังชีวิตเป็นจำนวนเต็มบวก คั่นด้วยเว้นวรรค
ข้อมูลออก
บรรทัดแรก แสดงจำนวนกระสุนทั้งหมดที่ใช้ยิงซอมบี้ จนตายทุกตัว
บรรทัดที่สอง แสดงคำตอบ 1 บรรทัด ระบุว่าซอมบี้แต่ละตัวจะตายในกระสุนนัดที่เท่าไหร่ คั่นด้วยเว้นวรรค
ตัวอย่าง
ข้อมูลเข้า	ข้อมูลออก
3
3 6 3 12 63 3	30
1 3 4 8 29 30
10
25 92 64	20
3 13 20
50
50 32 194 225	11
1 2 6 11'''
bulletdamage = int(input())
zombiehp = input().split()
countbullet = 0
allbullets = []
usebullet = []
for hp in zombiehp:
    hp = int(hp)
    bullets = (hp + bulletdamage - 1) // bulletdamage
    countbullet += bullets
    allbullets.append(bullets)
    
total = 0 
for bullets in allbullets:
    total += bullets 
    usebullet.append(total)
    
print(countbullet)
for bullets in usebullet:
    print(bullets, end=" ")