'''เกมอ่านใจ (ส่วนเช็คคำตอบ)
เกมอ่านใจเป็นเกมที่จะให้ผู้เล่นทายสายอักขระที่ถูกซ่อนไว้ เมื่อผู้เล่นทายสายอักขระแต่ละครั้งก็จะได้ผลลัพธ์ว่ามีจำนวนตัวอักขระที่ถูกต้องและตรงตำแหน่งกี่ตัว และที่ถูกต้องแต่ไม่ตรงตำแหน่งกี่ตัว ด้วยข้อมูลนี้ผู้เล่นก็จะทายสายอักขระครั้งใหม่ ไปเรื่อยๆ จนกว่าจะได้คำตอบหรือหมดจำนวนครั้งที่ให้ทาย

ให้นิสิตเขียนโปรแกรมส่วนเช็คคำตอบของการทายสายอักขระ โดยโปรแกรมจะรับสายอักขระมาสองสาย สายแรกคือสายอักขระที่ซ่อนไว้ และสายที่สองคือสายอักขระที่ผู้เล่นทาย จากนั้นให้พิมพ์เลขจำนวนเต็มออกมาสองค่า ค่าแรกคือจำนวนอักขระที่ทายถูกต้องและตรงตำแหน่ง ค่าที่สองคือจำนวนอักขระที่ทายถูกต้องแต่ไม่ตรงตำแหน่ง

ตัวอย่าง Input/Output 1
pyramid
program
1-3
คำอธิบาย:

ผลลัพธ์ 1-3 หมายถึงมีอักขระที่ตรงตำแหน่งหนึ่งตัวและมีอักขระที่ถูกต้องแต่ไม่ตรงตำแหน่ง 3 ตัว เมื่อพิจารณาข้อมูลเข้าจะเห็นว่า pyramid เป็นคำที่ซ่อนไว้ ส่วนผู้ใช้ทายคำว่า program
จะเห็นว่าตัวอักขระที่ถูกต้องและตรงกันก็คือ p ตัวแรกตัวเดียว
ตัว r ในตำแหน่งที่สองของคำว่า program นั้นจะจับคู่กับ r ในตำแหน่งที่สามของคำว่า pyramid นั่นคืออักขระถูกแต่ไม่ตรงตำแหน่ง
ตัว o และ g ในคำว่า program นั้นไม่มีในคำว่า pyramid เลย
ตัว r ตัวที่สองในคำว่า program นั้นไม่มีคู่ เนื่องจากตัว r ตัวเดียวในคำว่า pyramid นั้นถูกจับคู่กับตัว r ในตำแหน่งที่สองของคำว่า program ไปแล้ว
ตัว a และตัว m ในคำว่า program นั้นก็มีอยู่ในคำว่า pyramid เช่นกัน และยังไม่ถูกจับคู่กับใครด้วย แต่อยู่ผิดตำแหน่ง
ดังนั้น ตรงตำแหน่ง: p ผิดตำแหน่ง: r, a, m
ตัวอย่าง Input/Output 2
pant
test
1-0
คำอธิบาย:

มีตัวอักขระที่ถูกต้องตรงกันอยู่ตัวเดียวคือ t ตัวสุดท้าย ส่วน t ตัวแรกใน test นั้นไม่สามารถจับคู่กับใครได้เพราะ t ในคำว่า pant นั้นจับคู่ตรงกับ t ตัวสุดท้ายใน test ไปแล้ว เราจะจับคู่อักขระที่ตรงตำแหน่งกันก่อนเสมอ
หมายเหตุ:

ตามกฎเกณฑ์นี้นั้นถ้าเราสลับสายอักขระนำเข้าก็จะยังได้ผลลัพธ์เหมือนเดิม นั่นคือ pant-test กับ test-pant จะได้คำตอบเป็น 1-0 ทั้งคู่
โจทย์ข้อนี้เหมือนจะง่าย แต่จริงๆ แล้วมีรายละเอียดที่ต้องระวังเยอะ ขอให้ลองทดสอบกับสายอักขระที่หลากหลายเพื่อตรวจสอบความผิดพลาด
'''
