'''หมดสิทธิ์สอบ
คาบปฏิบัติการวิชา Fundamental Programming Concepts กำหนดว่า นิสิตที่มีความสำเร็จในการทำแบบฝึกหัดต่ำกว่าเกณฑ์ที่กำหนด จะหมดสิทธิ์สอบปฏิบัติการปลายภาค

ให้นิสิตเขียนโปรแกรมเพื่อจะตรวจสอบว่านิสิตคนใดหมดสิทธิ์สอบปฏิบัติการปลายภาค และแสดงรายชื่อของผู้หมดสิทธิ์สอบ

ข้อมูลเข้า
บรรทัดแรก รับจำนวนเต็มบวก แทนจำนวนแบบฝึกหัดทั้งหมด
บรรทัดที่สอง รับจำนวนจริงบวก แทนเกณฑ์ร้อยละของความสำเร็จในการทำแบบฝึกหัดที่ต้องการ หากนิสิตมีความสำเร็จในการทำแบบฝึกหัดต่ำกว่าเกณฑ์ร้อยละนี้ นิสิตจะหมดสิทธิ์สอบปฏิบัติการปลายภาค
บรรทัดที่สาม รับจำนวนเต็มบวก n แทนจำนวนนิสิตในวิชานี้
บรรทัดที่สี่เป็นต้นไป รับจำนวนเต็มบวก n บรรทัด บรรทัดละจำนวน แต่ละบรรทัดแทนจำนวนแบบฝึกหัดที่นิสิตคนนั้นทำสำเร็จ ตามลำดับของนิสิต หมายเลขที่ 1 ถึงหมายเลขที่ n
ข้อมูลออก
บรรทัดแรก แสดงจำนวนของนิสิตที่หมดสิทธิ์สอบปฏิบัติการปลายภาค
บรรทัดที่สองเป็นต้นไป แสดงหมายเลขของนิสิต และร้อยละของความสำเร็จในการทำแบบฝึกหัดของนิสิตคนนั้น คั่นด้วยช่องว่าง แต่นิสิตหมายเลขใดที่หมดสิทธิ์สอบให้แสดงวงเล็บครอบหมายเลขของนิสิตคนนั้นด้วย
ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
100
85.0
4
86
85
84
83
2
1 86.00
2 85.00
(3) 84.00
(4) 83.00
120
75
20
100
85
75
90
120
115
100
110
106
120
89
82
60
0
25
100
95
93
90
104
7
1 83.33
(2) 70.83
(3) 62.50
4 75.00
5 100.00
6 95.83
7 83.33
8 91.67
9 88.33
10 100.00
(11) 74.17
(12) 68.33
(13) 50.00
(14) 0.00
(15) 20.83
16 83.33
17 79.17
18 77.50
19 75.00
20 86.67'''
total = int(input())
p = float(input())
n = int(input())
data = []
while len(data) < n:
    x = int(input())
    data.append(x)
    
percent = [(x / total) * 100 for x in data]

failed = []
for i in range(n):
    if percent[i] < p:
        failed.append((i + 1, percent[i]))

print(len(failed))
for i in range(n):
    if (i + 1, percent[i]) in failed:
        print(f"({i + 1}) {percent[i]:.2f}")
    else:
        print(f"{i + 1} {percent[i]:.2f}")



