'''ผลบวกของหลักเลขจนเหลือหลักเดียว
ให้นิสิตเขียนโปรแกรมรับเลขจำนวนเต็มบวกเข้ามา แล้วหาผลบวกของเลขทุกหลัก ถ้าผลบวกยังมีมากกว่าหนึ่งหลักให้บวกเลขทุกหลักอีกครั้ง

ทั้งนี้ กำหนดให้ในการหาผลบวกของหลักเลขจนเหลือหลักเดียว ต้องเป็นการดำเนินการของจำนวนเต็มเท่านั้น (ไม่อนุญาตให้ใช้การทำงานในแบบ string หรือ list)

ตัวอย่างข้อมูลเข้า/ข้อมูลออก
ข้อมูลเข้า	ข้อมูลออก
23	5
24682	4
หมายเหตุ: 24682 บวกเลขทุกหลักแล้วได้ 22 เอา 22 มาบวกทุกหลักอีกทีจะได้ 4


'''
x = int(input())
while x > 9:
    sum = 0
    while x > 0:
       sum += x % 10
       x //= 10
    x = sum
print(x)