'''จับโปเกมอน !!!
ซาโตชิจากมาซาระทาวน์ต้องการเป็นโปเกมอนมาสเตอร์จึงต้องทำการจับโปเกมอนให้ได้หลายๆ ตัว การจับโปเกมอนต้องปาโปเกบอลไปให้โดนตัวมัน โปเกบอลจะเปิดออกแล้วดูดโปเกมอนเข้าไป แต่เนื่องจากค่าซื้อลูกโปเกบอลที่ใช้จับโปเกมอนมีราคาสูง ซาโตชิจากมาซาระทาวน์ต้องการรู้ว่าโอกาสในการจับโปเกมอนสำเร็จเป็นเท่าไหร่เพื่อใช้ประกอบการพิจารณาว่าจะลองจับโปเกมอนตัวนี้ดีหรือไม่ ซาโตชิจากมาซาระทาวน์จึงมาว่าจ้างนิสิตให้เขียนโปรแกรมทำนายความสำเร็จในการจับโปเกมอนให้

นิสิตได้ทำการศึกษาทดลองการจับโปเกมอนหลายรูปแบบและพบว่าโอกาสจับโปเกมอนสำเร็จขึ้นกับสามอย่าง นั่นคือคุณภาพของโปเกบอลที่ใช้ ระดับ(level)ของโปเกมอนที่ต้องการจับ และระยะห่างระหว่างโปเกมอนกับโปเกบอลเมื่อโปเกบอลเปิดออก และจากการวิเคราะห์ด้วยสมการถดถอยเชิงเส้นทำให้นิสิตสร้างตัวแบบในการคำนวณความสำเร็จในการจับโปเกมอนได้ดังนี้

s = 100 - (l * d * x)

เมื่อ

s คือเปอร์เซ็นความสำเร็จในการจับโปเกมอน
l คือระดับ (level) ของโปเกมอน
d คอระยะห่างระหว่างลูกโปเกบอลกับโปเกมอน (หน่วยเป็นเซ็นติเมตร)
x คือตัวปรับตามคุณภาพของโปเกบอลซึ่งมีสามระดับคือ High (H), Medium (M) และ Low (L)
ค่า x จะเปลี่ยนไปตามคุณภาพโปเกบอลเทียบกับระดับของโปเกมอนตามตาราง

คุณภาพโปเกบอล	ระดับโปเกมอน
0-40	41-60	61-100
High	0.01	0.01	0.01
Medium	0.03	0.05	0.08
Low	0.05	0.03	0.1
เช่นถ้าใช้โปเกบอลคุณภาพ Medium กับโปเกมอนระดับ 50 ค่า x จะเท่ากับ 0.05 เป็นต้น

ให้นิสิตเขียนโปรแกรมรับระดับของโปเกมอนเป็นเลขจำนวนเต็ม คุณภาพของโปเกบอลเป็นตัวอักษร H,M,L แทนคุณภาพ High, Medium, Low ตามลำดับ ตัวอักษรอาจเป็นตัวเล็กหรือตัวใหญ่ก็ได้ และสุดท้ายรับค่าระยะห่างระหว่างโปเกมอนกับโปเกบอลเป็นจำนวนเต็มหน่วยเซ็นติเมตร และพิมพ์เปอร์เซ็นที่จะจับโปเกมอนได้ออกมาเป็นเลขจุดทศนิยมสองตำแหน่ง เปอเซ็นที่จับโปเกมอนได้จะอยู่ระหว่าง 0.00 ถึง 100.00 ถ้าค่าที่คำนวณได้เกินช่วงนี้ให้ปรับให้อยู่ในช่วง (เช่นถ้าค่าติดลบให้ปรับเหลือ 0.00)

ตัวอย่างข้อมูลเข้าออก
Enter level pokemon: 50
Enter level pokeball: m
Enter distance: 23
42.50 percent.'''
l = int(input("Enter level pokemon: "))
x = input("Enter level pokeball: ")
d = int(input("Enter distance: "))
if x == "H" or x == "h" :
    if 0 <= l <= 40:
       x = 0.01
    elif 41 <= l <= 60:
        x = 0.01
    elif 61 <= l <= 100:
        x = 0.01
elif x == "M" or x == "m" :
    if 0 <= l <= 40:
        x = 0.03
    elif 41 <= l <= 60:
        x = 0.05
    elif 61 <= l <= 100:
        x = 0.08
elif x == "L" or x == "l" :
    if 0 <= l <= 40:
        x = 0.05
    elif 41 <= l <= 60:
        x = 0.03
    elif 61 <= l <= 100:
        x = 0.1
s = 100 - (l * d * x)
if s < 0:
    s = 0.00
elif s > 100:
    s = 100.00
print(f"{s:.2f} percent.")